This seems to change the mapping of ports to nodes, which causes Terraform to destroy and rebuild all nodes of an existing cluster after upgrading to Kubespray 2.19. This is very disruptive. I won't be able to manage my clusters with Terraform anymore (e.g. scale up/down nodes, modify security groups etc.) unless I destroy and rebuild them all from scratch.
Is there any workaround possible for existing users to keep using kubespray after upgrading to 2.19 without destroying and rebuilding all clusters @cristicalin @floryut @robinAwallace  ?

If I do `terraform plan` each node (including masters) shows e.g.
```
  # module.compute.openstack_compute_instance_v2.k8s_master_no_floating_ip[0] must be replaced
-/+ resource "openstack_compute_instance_v2" "k8s_master_no_floating_ip" {
      ~ access_ip_v4        = "192.168.243.200" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {
          - "depends_on"       = " "
          - "kubespray_groups" = "etcd,kube_control_plane,,k8s_cluster,no_floating"
          - "ssh_user"         = "almalinux"
          - "use_access_ip"    = "1"
        } -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ flavor_name         = "p2-3gb" -> (known after apply)
      ~ id                  = "83bf862c-51cb-4a3c-982b-8616d1926e48" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
        name                = "cluster-dev-k8s-master-nf-1"
      ~ region              = "RegionOne" -> (known after apply)
      ~ security_groups     = [
          - "cluster-dev-k8s",
          - "cluster-dev-k8s-master",
          - "cluster-dev-k8s-master-rules",
        ] -> (known after apply)
      - tags                = [] -> null
        # (7 unchanged attributes hidden)

      ~ block_device {
            # (7 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.168.243.200" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:e9:8d:18" -> (known after apply)
          ~ name           = "VLAN300" -> (known after apply)
          + port           = (known after apply) # forces replacement
          ~ uuid           = "4e8d0dcf-4853-454c-9184-d2379f397a9b" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }
```

As for use_neutron, it looks like that is used to determine whether to create a router and subnet etc whereas  use_existing_network mainly handles setting up the ports for the nodes, so I guess both are still needed.